#include <stdio.h>
#include <locale.h>

int main()
{
    setlocale(0,"Russian");
    int a,i,j,k,n,s;
    char *arr[] = {"сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"};
    char *arr1[]= {"двадцать", "тридцать", "сорок", "пятьдесят", "шесдесят", "семьдесят", "восемьдесят", "девяносто"};
    char *arr2[] = {"один", "два", "три", "четыре","пять","шесть","семь","восемь","девять","десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"};
    printf("Введите число в диапазоне от 100-999 ");
    scanf("%d", &a);
    i = a % 100;
    j = a / 100;
    k = i % 10;
    s = i / 10;
    if (a>99 && a<1000){
        if (i == 0){
            printf("%s", arr[j-1]);
    }
        else {
            if (i < 20)
                printf("%s %s", arr[j-1],arr2[i-1]);

            else {
                if (k > 0)
                    printf("%s %s %s", arr[j-1], arr1[s-2], arr2[k-1]);
                else
                    printf("%s %s", arr[j-1], arr1[s-2]);}
        }
        }
    else
        printf("Неверный диапазон");
    return 0;
}
