#include <stdio.h>
#include <locale.h>

int main()
{
    setlocale(0, "Russian");
    char *arr[] = {"десять", "одинадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать","двадцать","двадцать одно","двадцать два","двадцать три", "двадцать четыре", "двадцать пять", "двадцать шесть", "двадцать семь", "двадцать восемь", "двадцать девять", "тридцать", "тридцать одно", "тридцать два", "тридцать три", "тридцать четыре", "тридцать пять","тридцать шесть", "тридцать семь", "тридцать восемь", "тридцать девять", "сорок"};
    int a;
    printf("Введите a (от 10 до 40): ");
    scanf("%d", &a);
    if (a>=10 && a<=40){
        if(a == 21 || a == 31)
            printf("%s учебное задание", arr[a-10]);

        else
            printf("%s учебных заданий", arr[a-10]);

    }
    return 0;
}
