#include <stdio.h>
#include <locale.h>
int main(){
    setlocale(0, "Russian");
    int n, j;
    printf("Введите день от 1 до 31: ");
    scanf("%d",&j);
    printf("Введите месяц от 1 до 12: ");
    scanf("%d",&n);
    char *a[]={"первое","второе","третье","четвертое","пятое","шестое","седьмое","восьмое","девятое","десятое","одиннацатое","двенадцатое","тринадцатое","четырнадцатое","пятнадцатое","шестнадцатое","семьнадцатое","восемьнадцатое","девятнадцатое","двадцатое","двадцать первое","двадцать второе","двадцать третье","двадцать четвертое","двадцать пятое","двадцать шестое","двадцать седьмое","двадцать восьмое","двадцать девятое","тридцатое","тридцать первое",};
    char *arr[]={"января","февраля","марта","апреля","мая","июня","июля","августа","сентября","октября","ноября", "декабря"};
    if((n>=1 && n<=12)&&(j>=1 && j<=31))
        printf("%s %s", a[j-1], arr[n-1]);
    else
        printf("Неверный диапозон");
}
